In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [3]:
df["States"] = ["CA","NZ","AZ"]

In [4]:
df

     A    B  C States
0  1.0  5.0  1     CA
1  2.0  NaN  2     NZ
2  NaN  NaN  3     AZ

In [8]:
df.set_index("States",inplace=True)

In [9]:
df

          A    B  C
States
CA      1.0  5.0  1
NZ      2.0  NaN  2
AZ      NaN  NaN  3

In [10]:
df.dropna(axis=0)

          A    B  C
States
CA      1.0  5.0  1

In [12]:
df.dropna(axis=0,inplace=True)

In [14]:
df

          A    B  C
States
CA      1.0  5.0  1

In [16]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df["States"] = ["CA","NZ","AZ"]
df.set_index("States",inplace=True)

In [17]:
df

          A    B  C
States
CA      1.0  5.0  1
NZ      2.0  NaN  2
AZ      NaN  NaN  3

In [18]:
df.fillna("FILLER")

             A       B  C
States
CA           1       5  1
NZ           2  FILLER  2
AZ      FILLER  FILLER  3

In [19]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [20]:
df1 = pd.DataFrame(data)

In [21]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [22]:
g1 = df1.groupby("Company")

In [24]:
print(g1)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7ff5fd85d580>

In [25]:
g1.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [30]:
pd.DataFrame(df1.groupby("Company").describe().loc["FB"]).T

   Sales
   count   mean        std    min     25%    50%     75%    max
FB   2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [32]:
df2 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [33]:
df2

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [35]:
df2['A']

0    A0
1    A1
2    A2
3    A3
Name: A, dtype: object

In [36]:
df2.iloc[0]

A    A0
B    B0
C    C0
D    D0
Name: 0, dtype: object